Revit 2027 API
BuiltInFailures.StairRampFailures.NoRunsRampError Property
 Ramp has no Runs. Can't create Ramp.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public static FailureDefinitionId NoRunsRampError { get; }
Public Shared ReadOnly Property NoRunsRampError As FailureDefinitionId
	Get
public:
static property FailureDefinitionId^ NoRunsRampError {
	FailureDefinitionId^ get ();
}
static member NoRunsRampError : FailureDefinitionId with get
Property Value
FailureDefinitionId
See Also
Reference
BuiltInFailures.StairRampFailures Class
Autodesk.Revit.DB Namespace